#pragma once

#define MAX_LODS 4

struct XSurface
{
	char _pad1[0x30];
	int partBits[5];
};
STATIC_ASSERT_OFFSET(XSurface, partBits, 0x30);
STATIC_ASSERT_SIZE(XSurface, 0x44);

struct XModelLodInfo
{
	float dist;
	unsigned __int16 numsurfs;
	unsigned __int16 surfIndex;
	int partBits[5];
	char lod;
	char smcIndexPlusOne;
	char smcAllocBits;
	char unused;
};

struct XModelHighMipBounds
{
	float center[3];
	float himipRadiusSq;
};

struct XModelStreamInfo
{
	XModelHighMipBounds *highMipBounds;
};

struct XModel
{
	const char *name;
	char numBones;
	char numRootBones;
	char numsurfs;
	char lodRampType;

	union
	{
		unsigned __int16 *localBoneNames;
		unsigned __int16 *boneNames;
	};

	union
	{
		char *localParentList;
		char *parentList;
	};

	union
	{
		__int16 *localQuats;
		__int16 *quats;
	};

	union
	{
		float *localTrans;
		float *trans;
	};

	char *partClassification;
	/*DObjAnimMat*/ void *baseMat;
	XSurface *surfs;
	Material **materialHandles;
	XModelLodInfo lodInfo[MAX_LODS];
	char lodDistAutoGenerated;
	/*XModelCollSurf_s*/ void *collSurfs;
	int numCollSurfs;
	int contents;

	union
	{
		/*XBoneInfo*/ void *localBoneInfo;
		/*XBoneInfo*/ void *boneInfo;
	};

	float radius;
	float mins[3];
	float maxs[3];
	__int16 numLods;
	__int16 collLod;
	XModelStreamInfo streamInfo;
	int memUsage;
	int flags;
	bool bad;
	char _pad2[0x13];
};
STATIC_ASSERT_OFFSET(XModel, name, 0x0);
STATIC_ASSERT_OFFSET(XModel, surfs, 0x20);
STATIC_ASSERT_OFFSET(XModel, materialHandles, 0x24);
STATIC_ASSERT_OFFSET(XModel, lodInfo, 0x28);
STATIC_ASSERT_OFFSET(XModel, bad, 0xE8);
STATIC_ASSERT_SIZE(XModel, 0xFC);